Framework rework
