--- a/framework.md
+++ b/framework.md
@@ -4,57 +4,35 @@
 
 As proposed by prof. Luigi Palopoli in the integration meeting (October the 15th, 2024) in Heraklion, Crete, the software infrastructure will mainly encompass 3 components, as highlighted in the following diagram.
 
-```{mermaid}
-graph TD
-    ROS1[ROS2] --> XBOT[XBot2] 
-    RT1[RT application] -->XBOT
-    XBOT --> LNX1[Linux + Xenomai]
+```{plantuml}
+:width: 700px
+@startuml
+package "Robot Control" {
+  [ROS2] -down-> [XBot2]
+  [RT Application] -down-> [XBot2]
+  [XBot2] -down-> [Linux + Xenomai]
+}
 
-    RT2[RT application]
-    ROS2[ROS2]
-    LNX2[Linux + RT patch]
-    RT2 --> LNX2
-    ROS2 --> LNX2
+package "RT Applications" {
+  [RT Application ] -down-> [Linux + RT Patch]
+  [ROS2 ] -down-> [Linux + RT Patch]
+}
 
-
-    ROS3[ROS2]
-    DB[Database]
-    APP[Non-RT applications]
-
-    ROS3 --> DB
-    DB <--> APP
-    %% LNX3 --> APP
-    %% ROS2 <--> ROS1
-    %% ROS2 --> ROS3
-
-    subgraph "Non-RT Applications"
-        ROS3
-        DB
-        APP
-        %% LNX3
-    end
-
-    subgraph "RT Applications"
-        ROS2
-        RT2
-        LNX2
-    end
-    
-    subgraph "Robot Control"
-        ROS1 
-        XBOT
-        RT1
-        LNX1
-    end
+package "Non-RT Applications" {
+  database "Database"
+  [ ROS2] -down-> Database
+  Database <-down-> [Non-RT Application]
+}
+@enduml
 ```
 
 The low-level control of the robot will be based on the RT framework developed by IIT, [XBot2](https://advrhumanoids.github.io/xbot2/master/index.html).
 To work, we will need surely a real-time patched Linux kernel, and maybe the [Xenomai](https://xenomai.org/) co-kernel for hard RT applications.
